{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2022-2023)",
        "GPA: 3.92/4.0"
      ],
      "degree": "Postgraduate Certificate",
      "department": "Applied Computer Science \u0026 IT",
      "duration": "2022-2023",
      "school_name": "Conestoga College"
    },
    {
      "awards_achievements": null,
      "degree": "Master of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2011-2013",
      "school_name": "K.N. Toosi University of Technology- Tehran, Iran"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-saeedmoghadam17",
  "highlighted_projects": [
    {
      "description": "Developed a command line object-oriented java database connectivity program that connects to MySQL and issues CRUD queries after validating user data. The program is built on entity and database transaction classes, input data validation, and a test program.",
      "git_url": "https://github.com/saeedmoghadam17/JDBC-Program-with-MySQL/settings",
      "name": "JDBC Program with MySQL- Conestoga College"
    },
    {
      "description": "Designed the sale data mart and OLAP cube from the OLTP database in a teamwork project to give the client its company's sale analysis capability. The project was developed on Oracle SQL Plus, SQL Developer and Analytical Workspace Manager.",
      "git_url": "https://github.com/saeedmoghadam17/DWH-and-Reporting-Solution-for-a-Retailer",
      "name": "DWH and Reporting Solution for a Retailer- Conestoga College"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Minimum Viable Linux Cluster Monitoring Agent that monitors nodes' hardware information and resource usage every minute and stores it in a PostgreSQL database. The Dockerized application was deployed by SQL and Bash Scripts.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Saeed Moghadam",
  "others": [
    {
      "bullets": [
        "Dean's List (2022-2023)"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "swimmer"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed projects using GitFlow, incorporating technologies and tools like Bash, SQL, and Java languages, Google Cloud Platform, Spring Boot framework, and Docker container. Collaborated with a team in daily scrum meetings and bi-weekly sprint meetings to implement Agile development practices as a software developer.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Nargan - Iran",
      "description": "Accomplished three petrochemical engineering teamwork projects with multi-tasks responsibilities: data management, documentation, proposal, data reporting, and technical bead evaluation. Developed Excel VBA codes to verify vendors' design databases or create technical diagrams. provided Excel and Power BI reports that improved the company's sale performance and reducing costs.",
      "duration": "2015-2020",
      "title": "Electronics Engineer"
    }
  ],
  "skills": {
    "competent": [
      "OLAP and Data Warehousing",
      "Web Technology (HTML/CSS)",
      "VBA Excel (Macro)",
      "Power Query and ETL",
      "Power BI"
    ],
    "familiar": [
      "Hadoop Ecosystem and Apache HIVE",
      "Python",
      "AWS and GCP Cloud",
      "DAX query",
      "Java Script"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Docker",
      "Spring Boot",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I'm a hardworking and self-motivated Software Developer at Jarvis with an academic background in web database application development from Conestoga College. I am skilled in Core Java, Spring Boot, Bash Script, SQL language, and database design. I'm eager to learn new tools and technologies and desire to grow and excel in software development."
}
